/*********************************************************************************************************
* 模块名称：
* 摘    要：
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日  
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "LED.h"
#include "stm32f10x_gpio.h"
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
 
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void ConfigLEDGPIO(void);
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：
* 函数功能：
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
static void ConfigLEDGPIO()
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);
  
  GPIO_InitStructure.GPIO_Pin=GPIO_Pin_4;
  GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC,&GPIO_InitStructure);
  
  GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_SET);
  
  GPIO_InitStructure.GPIO_Pin=GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC,&GPIO_InitStructure);
  
  GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_RESET);
}
/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：
* 函数功能：
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void InitLED(void)
{
  ConfigLEDGPIO();
}

void LEDFlickerChoice(char i)
{
  switch(i)
  {
    case 1:LEDFlicker1();break;
    case 2:LEDFlicker2();break;
    case 3:LEDFlicker3();break;
    case 4:LEDFlicker4();break;
    default:break;
  }
}

void LEDFlicker1()
{
  
    //LED1状态
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_RESET);
    //LED2状态
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_RESET);
  
}
void LEDFlicker2()
{
 
   
    //LED1状态
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_SET);
    //LED2状态
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_RESET);
  
}
void LEDFlicker3()
{
    //LED1状态
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_RESET);
    //LED2状态
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_SET);
  
}
void LEDFlicker4()
{

  
    //LED1状态
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_SET);
    //LED2状态
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_SET);
  
}
