/*********************************************************************************************************
* 模块名称：RunClock.c
* 摘    要：RunClock模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日 
* 内    容：
* 注    意：none                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "RunClock.h"
#include <stdio.h>
#include <string.h>
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static  i16 s_itick;
static  i16 s_imonth;
static  i16 s_iday;
static  char strweek[20];

static  u8  s_iClockPauseFlag = 0;  //TRUE-暂停，FALSE-正常运行
 
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitRunClock
* 函数功能：初始化RunClock模块 
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  InitRunClock(void)
{
  s_itick=0;
  s_imonth = 0;
  s_iday  = 0;
}

/*********************************************************************************************************
* 函数名称：RunClockPer2Ms
* 函数功能：计数模块，每2ms调用一次 
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
int Day(int tick,  int day)
{
	int i, j;
	int monthmax = 0;
	int arrMonth[12] = { 31,29,31,30,31,30,31,31,30,31,30,31 };

	for (i = 0, j = 0; i < 366; i++)
	{
		if (tick <= monthmax)
		{
			day = tick - (monthmax - arrMonth[j-1]);
		}
		else if(tick > monthmax)
		{
			monthmax += arrMonth[j];
			day = tick - (monthmax - arrMonth[j]);
			j++;
		}
	}
	return (day);
}
int Month(int tick, int month)
{
	int i,j;
	int monthmax=0;
	int arrMonth[12] = { 31,29,31,30,31,30,31,31,30,31,30,31 };

	for (i = 0,j=0; i < 366; i++)
	{
		if (tick <= monthmax)
		{
			month = j;
		}
		else 
		{
			monthmax += arrMonth[j];
			j++;
		}
	}
	return (month);
}
void week(int tick, char str[20])
{
	int y = 0;

	if (tick > 5)
	{
		y = (tick - 5) % 7;
	}
	if (tick <= 5)
	{
		y = tick + 2;
	}
	switch (y)
	{
	case mon: strcpy(str, "Monday"); break;
	case tues: strcpy(str,  "Tues"); break;
	case wed: strcpy(str, "Wednes"); break;
	case thur: strcpy(str, "Thur"); break;
	case fri: strcpy(str,  "Fri"); break;
	case sat: strcpy(str,  "Sat"); break;
	case sun: strcpy(str, "Sun"); break;
	case sun_1: strcpy(str, "Sun"); break;
	default:
		break;
	}
}

void  RunClockPer2Ms(void)
{
  static i16 s_iCnt500 = 0;

  if(499 <= s_iCnt500 && 0 == s_iClockPauseFlag)
  {
    s_itick++;
    s_iday=Day(s_itick, s_iday);
    s_imonth=Month(s_itick, s_imonth);
    week(s_itick, strweek);
    s_iCnt500 = 0;
  }
  else
  {
    s_iCnt500++;
  }
}

/*********************************************************************************************************
* 函数名称：PauseClock
* 函数功能：实现时钟的启动和暂停 
* 输入参数：flag，1-暂停，0-启动
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/      
void  PauseClock(u8 flag)
{
  s_iClockPauseFlag = flag;  
}

/*********************************************************************************************************
* 函数名称：GetTimeVal
* 函数功能：获取当前的时间值 
* 输入参数：时间值的类型
* 输出参数：void
* 返 回 值：获取的时间值，小时、分钟或秒
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
i16   GetTimeVal(u8 type)
{
  i16 timeVal;
  switch(type)
  {
  case TIME_VAL_HOUR:
    timeVal = s_iday;
    break;
  case TIME_VAL_MIN:
    timeVal = s_imonth;
    break;
  default:
    break;
  } 
  
  return(timeVal);
}
void GetWeekVal(u8 type,char str[20])
{
  char weekVal[20];
  switch(type)
  {
  case TIME_VAL_SEC:
    strcpy(weekVal,  strweek);
    break;
  default:
    break;
  } 
  strcpy(str,weekVal);
}
/*********************************************************************************************************
* 函数名称：SetTimeVal
* 函数功能：设置当前的时间值 
* 输入参数：type-时间值的类型，timeVal-要设置的时间值
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/      
void SetTimeVal(i16 timeVal)
{
  s_itick=timeVal;
}   
/*********************************************************************************************************
* 函数名称：DispTime
* 函数功能：显示当前的时间
* 输入参数：hour，min，sec
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  DispTime(i16 month, i16 day, char week[20])    //显示当前的时间
{
  printf("2018年%02d月%02d日-%s\n", month,day, week);
}
